import pandas as pd
import numpy as np
import os
rootdir = u'D:\\Climate\\SELECT'  # 存放文件的根目录
out_fold = 'D:\\Climate\\SELECT-FIX\\'   # 输出文件目录

for parent, dirnames, filenames in os.walk(rootdir):   # 此时filenames 是一个存放了所有文件名的列表
    print(filenames)  # 用于存放读取文件的文件名
# =================================================================================================================
# 地温GST校正模块
os.chdir('D:\\Climate\\SELECT')
for file in filenames:
    if file[:2] =='地温':
        print(f'正在处理 {file}!')
        read = pd.read_csv(file)
        read.loc[read['观测场海拔高度'] > 10000, '观测场海拔高度'] = read.loc[read['观测场海拔高度'] > 10000, '观测场海拔高度'] - 10000
        # 校正海拔数值，原数据当台站海拔高度为估测值时，在估测数据基础上加10000，故反向操作将估测值的站点海拔减去10000
        read = read.drop(read[(read['平均地表气温'] == 3276.6000000000004) | (read['日最高地表气温'] == 3276.6000000000004) | (read['日最低地表气温'] == 3276.6000000000004)].index)
        # 删除满足条件的特定行，解决了缺失值行的处理，在原数据中，3276.6000000000004代表缺失值
        read.loc[read['平均地表气温'] > 1000, '平均地表气温'] = read.loc[read['平均地表气温'] > 1000, '平均地表气温'] - 1000
        read.loc[read['日最高地表气温'] > 1000, '日最高地表气温'] = read.loc[read['日最高地表气温'] > 1000, '日最高地表气温'] - 1000
        read.loc[read['日最低地表气温'] > 1000, '日最低地表气温'] = read.loc[read['日最低地表气温'] > 1000, '日最低地表气温'] - 1000
        # 实际温度（零上）超仪器上限刻度，在上限数据基础上加1000,逆向操作
        read.loc[read['平均地表气温'] < -1000, '平均地表气温'] = read.loc[read['平均地表气温'] < -1000] + 1000
        read.loc[read['日最高地表气温'] < -1000, '日最高地表气温'] = read.loc[read['日最高地表气温'] < -1000, '日最高地表气温'] + 1000
        read.loc[read['日最低地表气温'] < -1000, '日最低地表气温'] = read.loc[read['日最低地表气温'] < -1000, '日最低地表气温'] + 1000
        # 实际温度（零下）超仪器下限刻度，在下限数据基础上减1000
        read.to_csv(out_fold+file, index=False)
# =================================================================================================================
# 日照SST校正模块
    elif file[:2] =='日照':
        print(f'正在处理 {file}!')
        read = pd.read_csv(file)
        read.loc[read['观测场海拔高度'] > 10000, '观测场海拔高度'] = read.loc[read['观测场海拔高度'] > 10000, '观测场海拔高度'] - 10000
        # 校正海拔数值，原数据当台站海拔高度为估测值时，在估测数据基础上加10000，故反向操作将估测值的站点海拔减去10000
        read = read.drop(read[(read['日照时数'] == 3276.6000000000004)].index)
        # 删除满足条件的特定行，解决了缺失值行的处理，在原数据中，3276.6000000000004代表缺失值
        read.to_csv(out_fold + file, index=False)
# =================================================================================================================
# 气压PRS校正模块
    elif file[:2] == '气压':
        print(f'正在处理 {file}!')
        read = pd.read_csv(file)
        read.loc[read['观测场海拔高度'] > 10000, '观测场海拔高度'] = read.loc[read['观测场海拔高度'] > 10000, '观测场海拔高度'] - 10000
        # 校正海拔数值，原数据当台站海拔高度为估测值时，在估测数据基础上加10000，故反向操作将估测值的站点海拔减去10000
        read = read.drop(read[(read['平均本站气压'] == 3276.6000000000004) | (read['日最高本站气压'] == 3276.6000000000004) | (read['日最低本站气压'] == 3276.6000000000004)].index)
        # 删除满足条件的特定行，解决了缺失值行的处理，在原数据中，3276.6000000000004代表缺失值
        read.loc[read['平均本站气压'] > 2000, '平均本站气压'] = read.loc[read['平均本站气压'] > 2000, '平均本站气压'] - 2000
        read.loc[read['日最高本站气压'] > 2000, '日最高本站气压'] = read.loc[read['日最高本站气压'] > 2000, '日最高本站气压'] - 2000
        read.loc[read['日最低本站气压'] > 2000, '日最低本站气压'] = read.loc[read['日最低本站气压'] > 2000, '日最低本站气压'] - 2000
        # 气压极值取自定时值，在原值上加2000，故反向操作将大于2000的值均减去2000，因为正常值是不可能大于2000
        read.to_csv(out_fold+file, index=False)

# =================================================================================================================
# 温度TEM校正模块
    elif file[:2] == '温度':
        print(f'正在处理 {file}!')
        read = pd.read_csv(file)
        read.loc[read['观测场海拔高度'] > 10000, '观测场海拔高度'] = read.loc[read['观测场海拔高度'] > 10000, '观测场海拔高度'] - 10000
        # 校正海拔数值，原数据当台站海拔高度为估测值时，在估测数据基础上加10000，故反向操作将估测值的站点海拔减去10000
        read = read.drop(read[(read['平均气温'] == 3276.6000000000004) | (read['日最高气温'] == 3276.6000000000004) | (read['日最低气温'] == 3276.6000000000004)].index)
        # 删除满足条件的特定行，解决了缺失值行的处理，在原数据中，3276.6000000000004代表缺失值
        read.to_csv(out_fold + file, index=False)

# =================================================================================================================
# 相对湿度RHU校正模块
    elif file[:4] == '相对湿度':
        print(f'正在处理 {file}!')
        read = pd.read_csv(file)
        read.loc[read['观测场海拔高度'] > 10000, '观测场海拔高度'] = read.loc[read['观测场海拔高度'] > 10000, '观测场海拔高度'] - 10000
        # 校正海拔数值，原数据当台站海拔高度为估测值时，在估测数据基础上加10000，故反向操作将估测值的站点海拔减去10000
        read = read.drop(read[(read['平均相对湿度'] == 32766) | (read['最小相对湿度(仅自记)'] == 32766)].index)
        # 删除满足条件的特定行，解决了缺失值行的处理，在原数据中，3276.6000000000004代表缺失值
        read.loc[read['平均相对湿度'] > 300, '平均相对湿度'] = read.loc[read['平均相对湿度'] > 300, '平均相对湿度'] - 300
        read.loc[read['最小相对湿度(仅自记)'] > 300, '最小相对湿度(仅自记)'] = read.loc[read['最小相对湿度(仅自记)'] > 300, '最小相对湿度(仅自记)'] - 300
        read.to_csv(out_fold + file, index=False)
        # 原数据最小相对湿度取自定时值，在原值上加300，故对其进行还原操作当其值>300时将其减去300

# =================================================================================================================
# 蒸发EVP校正模块
    elif file[:2] == '蒸发':
        print(f'正在处理 {file}!')
        read = pd.read_csv(file)
        read.loc[read['观测场海拔高度'] > 10000, '观测场海拔高度'] = read.loc[read['观测场海拔高度'] > 10000, '观测场海拔高度'] - 10000
        # 校正海拔数值，原数据当台站海拔高度为估测值时，在估测数据基础上加10000，故反向操作将估测值的站点海拔减去10000
        read = read.drop(read[(read['小型蒸发量'] == 3276.6000000000004) & (read['大型蒸发量'] == 3276.6000000000004)].index)
        # 删除满足条件的特定行，解决了缺失值行的处理，在原数据中，3276.6000000000004代表缺失值
        read.loc[read['小型蒸发量'] == 3276.6000000000004, '小型蒸发量'] = 1.437+read.loc[read['小型蒸发量'] == 3276.6000000000004, '大型蒸发量']*1.025
        read.loc[read['大型蒸发量'] == 3276.6000000000004, '大型蒸发量'] = -0.085+read.loc[read['大型蒸发量'] == 3276.6000000000004, '小型蒸发量']*0.736
        read.loc[read['大型蒸发量'] < 0, '大型蒸发量'] = 0  # 大型蒸发量可能出现负值，负值全部按0处理
        # 蒸发器中注入的水全部蒸发，在注入的水量数据基础上加100
        read.loc[read['小型蒸发量'] > 100, '小型蒸发量'] = read.loc[read['小型蒸发量'] > 100, '小型蒸发量'] - 100
        read.loc[read['大型蒸发量'] > 100, '大型蒸发量'] = read.loc[read['大型蒸发量'] > 100, '大型蒸发量'] - 100
        read.to_csv(out_fold + file, index=False)
        # 蒸发缺失值较多，不可将所有缺失值全部删除，将两项均缺失的进行删除，再将缺失一项的通过与另一项之间的关系进行补齐

# =================================================================================================================
# 降水PRE校正模块
    elif file[:2] == '降水':
        print(f'正在处理 {file}!')
        read = pd.read_csv(file)
        read.loc[read['观测场海拔高度'] > 10000, '观测场海拔高度'] = read.loc[read['观测场海拔高度'] > 10000, '观测场海拔高度'] - 10000
        # 校正海拔数值，原数据当台站海拔高度为估测值时，在估测数据基础上加10000，故反向操作将估测值的站点海拔减去10000
        read = read.drop(read[(read['20-8时降水量'] == 3276.6000000000004) & (read['8-20时降水量'] == 3276.6000000000004) & (read['20-20时累计降水量'] == 3276.6000000000004)].index)
        # 删除满足条件的特定行，解决了缺失值行的处理，在原数据中，3276.6000000000004代表缺失值,当3项均为缺失值时将其删除
        read = read.drop(read[(read['20-8时降水量'] == 3276.6000000000004) & (read['8-20时降水量'] == 3276.6000000000004)].index)
        read = read.drop(read[(read['20-8时降水量'] == 3276.6000000000004) & (read['20-20时累计降水量'] == 3276.6000000000004)].index)
        read = read.drop(read[(read['8-20时降水量'] == 3276.6000000000004) & (read['20-20时累计降水量'] == 3276.6000000000004)].index)
        # 3项中只要有2项是空值便将其删除
        read.loc[(read['20-8时降水量'] == 3270.0) & (read['8-20时降水量'] == 3270.0) & (read['20-20时累计降水量'] == 3270.0), '20-8时降水量'] = 0
        read.loc[(read['20-8时降水量'] == 3270.0) & (read['8-20时降水量'] == 3270.0) & (read['20-20时累计降水量'] == 3270.0), '8-20时降水量'] = 0
        read.loc[(read['20-8时降水量'] == 3270.0) & (read['8-20时降水量'] == 3270.0) & (read['20-20时累计降水量'] == 3270.0), '20-20时累计降水量'] = 0
        # 当3项都为3270.0时表明降水非常微量，可认为3个时间段的降水量均为0
        # 考虑两项为3270.0的情况
        read.loc[(read['20-8时降水量'] == 3270.0) & (read['8-20时降水量'] == 3270.0), '20-8时降水量'] = 0
        read.loc[(read['20-8时降水量'] == 3270.0) & (read['8-20时降水量'] == 3270.0), '8-20时降水量'] = 0
        read.loc[(read['8-20时降水量'] == 3270.0) & (read['20-20时累计降水量'] == 3270.0), '8-20时降水量'] = 0
        read.loc[(read['8-20时降水量'] == 3270.0) & (read['20-20时累计降水量'] == 3270.0), '20-20时累计降水量'] = read.loc[(read['8-20时降水量'] == 3270.0) & (read['20-20时累计降水量'] == 3270.0), '8-20时降水量']
        read.loc[(read['20-8时降水量'] == 3270.0) & (read['20-20时累计降水量'] == 3270.0), '20-8时降水量'] = 0
        read.loc[(read['20-8时降水量'] == 3270.0) & (read['20-20时累计降水量'] == 3270.0), '20-20时累计降水量'] = read.loc[(read['20-8时降水量'] == 3270.0) & (read['20-20时累计降水量'] == 3270.0), '20-8时降水量']

        # --------------------------------------------------------------------------------------------------------------------------
        read.loc[read['20-8时降水量'] == 3270.0, '20-8时降水量'] = read.loc[read['20-8时降水量'] == 3270.0, '20-20时累计降水量'] - read.loc[read['20-8时降水量'] == 3270.0, '8-20时降水量']
        read.loc[read['8-20时降水量'] == 3270.0, '8-20时降水量'] = read.loc[read['8-20时降水量'] == 3270.0, '20-20时累计降水量'] - \
                                                                  read.loc[read['8-20时降水量'] == 3270.0, '20-8时降水量']
        read.loc[read['20-20时累计降水量'] == 3270.0, '20-20时累计降水量'] = read.loc[read['20-20时累计降水量'] == 3270.0, '20-8时降水量'] + \
                                                                  read.loc[read['20-20时累计降水量'] == 3270.0, '8-20时降水量']
        read.to_csv(out_fold + file, index=False)
# =================================================================================================================
# 风向风速WIN校正模块
    elif file[:4] == '风向风速':
        print(f'正在处理 {file}!')
        read = pd.read_csv(file)
        read.loc[read['观测场海拔高度'] > 10000, '观测场海拔高度'] = read.loc[read['观测场海拔高度'] > 10000, '观测场海拔高度'] - 10000
        # 校正海拔数值，原数据当台站海拔高度为估测值时，在估测数据基础上加10000，故反向操作将估测值的站点海拔减去10000
        # 缺失值的处理思路：3项均缺失直接删除，缺2项则用一项补齐一项（组合3种情况），缺1项用任两项进行补齐
        read = read.drop(read[(read['平均风速'] == 3276.6000000000004) & (read['最大风速'] == 3276.6000000000004) & (read['极大风速'] == 3276.6000000000004)].index)
        # 将3项均为空的进行删除处理
        read.loc[(read['平均风速'] == 3276.6000000000004) & (read['最大风速'] == 3276.6000000000004), '最大风速'] = read.loc[(read['平均风速'] == 3276.6000000000004) &\
        (read['最大风速'] == 3276.6000000000004), '极大风速']*read.loc[(read['平均风速'] == 3276.6000000000004) & (read['最大风速'] == 3276.6000000000004), '极大风速']*0.003 + \
         read.loc[(read['平均风速'] == 3276.6000000000004) & (read['最大风速'] == 3276.6000000000004), '极大风速']*0.54+0.288
        # ----------------------------------------------------------------------------------------------------------------------
        read.loc[(read['平均风速'] == 3276.6000000000004) & (read['极大风速'] == 3276.6000000000004), '极大风速'] = read.loc[(read['平均风速'] == 3276.6000000000004) & (read['极大风速'] == 3276.6000000000004), '最大风速']*1.438+1.024
        # -----------------------------------------------------------------------------------------------------------------------
        read.loc[(read['最大风速'] == 3276.6000000000004) & (read['极大风速'] == 3276.6000000000004), '最大风速'] = read.loc[(read['最大风速'] == 3276.6000000000004) & (read['极大风速'] == 3276.6000000000004), '平均风速']*1.406+2.138
        # ====================================================================================================================================
        read.loc[read['平均风速'] == 3276.6000000000004, '平均风速'] = read.loc[read['平均风速'] == 3276.6000000000004, '最大风速']*read.loc[read['平均风速'] == 3276.6000000000004, '最大风速']*0.009+read.loc[read['平均风速'] == 3276.6000000000004, '最大风速']*0.323+0.183
        read.loc[read['最大风速'] == 3276.6000000000004, '最大风速'] = read.loc[read['最大风速'] == 3276.6000000000004, '平均风速']*1.406+2.138
        read.loc[read['极大风速'] == 3276.6000000000004, '极大风速'] = read.loc[read['极大风速'] == 3276.6000000000004, '最大风速']*1.438+1.024
        read.to_csv(out_fold + file, index=False)







