'''
查询数据
使用execute()函数得到的只是受影响的行数，并不能真正拿到查询的内容。cursor对象还提供了3种提取数据的方法：
fetchone、fetchmany、fetchall.。每个方法都会导致游标动，所以必须注意游标的位置。
cursor.fetchone():获取游标所在处的一行数据，返回元组，没有返回None
cursor.fetchmany(size):接受size行返回结果行。如果size大于返回的结果行的数量，则会返回cursor.arraysize条数据。
cursor. fetchall():接收全部的返回结果行。
'''
#
#
#
import pymysql
import xlwt
#打开数据库连接
conn = pymysql.connect(host='localhost', user="root", password="xianyu129742", database="data_analyse", charset="utf8")

# #生成游标对象
cur = conn.cursor()
#
# idd = ['34', '3401', '340102', '340103', '340104', '340111', '340121', '340122', '340123', '340125', '340181', '3402',
# '340202', '340203', '340207', '340208', '340221', '340222', '340223', '340225', '3403', '340302', '340303', '340304',
# '340311', '340321', '340322', '340323', '3404', '340402', '340403', '340404', '340405', '340406', '340421', '3405',
# '340503', '340504', '340506', '340521', '340522', '340523', '3406', '340602', '340603', '340604', '340621', '3407',
# '340702', '340703', '340711', '340721', '3408', '340802', '340803', '340811', '340822', '340823', '340824', '340825',
# '340826', '340827', '340828', '340881', '3410', '341002', '341003', '341004', '341021', '341022', '341023', '341024',
# '3411', '341102', '341103', '341122', '341124', '341125', '341126', '341181', '341182', '3412', '341202', '341203',
# '341204', '341221', '341222', '341225', '341226', '341282', '3413', '341302', '341321', '341322', '341323', '341324',
# '3415', '341502', '341503', '341521', '341522', '341523', '341524', '341525', '3416', '341602', '341621', '341622',
# '341623', '3417', '341702', '341721', '341722', '341723', '3418', '341802', '341821', '341822', '341823', '341824',
# '341825', '341881', '341899', '3499', '349999', '340124', '340422', '340705', '340706', '340722', '341504', '340882']
idd = ['安徽省','合肥市','瑶海区','庐阳区','蜀山区','包河区','长丰县','肥东县','肥西县','庐江县',
        '巢湖市','芜湖市','镜湖区','弋江区','鸠江区','三山区','芜湖县','繁昌县','南陵县','无为县',
        '蚌埠市','龙子湖区','蚌山区','禹会区','淮上区','怀远县','五河县','固镇县','淮南市','大通区',
        '田家庵区','谢家集区','八公山区','潘集区','凤台县','马鞍山市','花山区','雨山区','博望区',
        '当涂县','含山县','和县','淮北市','杜集区','相山区','烈山区','濉溪县','铜陵市','铜官山区',
        '狮子山区','郊区','铜陵县','安庆市','迎江区','大观区','宜秀区','怀宁县','枞阳县','潜山县',
        '太湖县','宿松县','望江县','岳西县','桐城市','黄山市','屯溪区','黄山区','徽州区','歙县',
        '休宁县','黟县','祁门县','滁州市','琅琊区','南谯区','来安县','全椒县','定远县','凤阳县',
        '天长市','明光市','阜阳市','颍州区','颍东区','颍泉区','临泉县','太和县','阜南县','颍上县',
        '界首市','宿州市','墉桥区','砀山县','萧县','灵璧县','泗县','六安市','金安区','裕安区','寿县',
        '霍邱县','舒城县','金寨县','霍山县','亳州市','谯城区','涡阳县','蒙城县','利辛县','池州市',
        '贵池区','东至县','石台县','青阳县','宣城市','宣州区','郎溪县','广德县','泾县','绩溪县',
'旌德县','宁国市','不详县','不详市','不详县','庐江县','寿县','铜官区','义安区','枞阳县','叶集区','潜山市']
year = ['2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017', '2018'
        '2019', '2020']
m = []
for a in year:
    for i in idd:  #分市进行查询
        d = ['01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12']
        for j in d:
            one = a+j+'01'
            last = a+j+'31'
            sql ="select count(*) from 个案数据完整 where  nlive like '%"+i+"%'"+" and data between "+one+' and '+last
            #此时查出来的是某年某地方一个月的发病数
            cur.execute(sql)  #执行SQL语句
            data = cur.fetchone()  # 通过fetchone方法获取数据,但此时data的数据形式为元组，
            print(sql)
            print(f'{i}{a}年{j}月的发病数是：')
            print(data)
            m.append(data[0])

print(m)

new = [['01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12']]


#该方法取值存在问题，即new2作为容器列表，当其值每次发生改变时，其加到new里的每个列表值都发生改变，即加到new里的列表指向的依然是new2;
# new2 = []
# a = 0
# for i in m:
#     if a < 12:
#         new2.append(i)
#         a += 1
#     else:
#         print(new2)
#         new.append(new2)
#         print(new)
#         a = 0
#         new2.clear()
#
# print(new)


#该模块将列表中的值按照每12个截取切片列表，在将切片列表作为新列表的元素加入到新列表中
x = True
k = 0
while x:
    if k+12 <= len(m):
        new.append(m[k:k+12])
        k += 12
    else:
        x = False
print(new)

#该模块实现将以上生成的列表按行写入excel表格并保存到指定路径
# 创建工作簿
f = xlwt.Workbook()
# 创建一个sheet
sheet1 = f.add_sheet('test', cell_overwrite_ok=True)

for i in range(len(new)):
    t = new[i]
    for j in range(len(t)):
        sheet1.write(i, j, t[j])

# 保存文件
f.save("C:\\Users\\xianyu\\Desktop\\10-11.xlsx")















