import pymysql
import xlwt
#打开数据库连接
conn = pymysql.connect(host='localhost', user="root", password="xianyu129742", database="data_analyse", charset="utf8")

# #生成游标对象
cur = conn.cursor()

idd = ['福建省','福州市','鼓楼区','台江区','仓山区','马尾区','晋安区','闽侯县','连江县','罗源县','闽清县',
       '永泰县','福清市','长乐市','不详县','厦门市','思明区','海沧区','湖里区','集美区','同安区','翔安区',
       '不详县','莆田市','城厢区','涵江区','荔城区','秀屿区','湄洲湾北岸经济开发区','湄洲岛区','仙游县','不详县',
       '三明市','梅列区','三元区','明溪县','清流县','宁化县','大田县','尤溪县','沙县','将乐县','泰宁县','建宁县',
       '永安市','不详县','泉州市','鲤城区','丰泽区','洛江区','泉港区','泉州经济技术开发区','台商投资区','惠安县',
       '安溪县','永春县','德化县','石狮市','晋江市','南安市','不详县','漳州市','芗城区','龙文区','云霄县','漳浦县',
       '诏安县','长泰县','东山县','南靖县','平和县','华安县','龙海市','不详县','南平市','延平区','顺昌县','浦城县',
       '光泽县','松溪县','政和县','邵武市','武夷山市','建瓯市','建阳市','不详县','龙岩市','新罗区','长汀县','永定县',
       '上杭县','武平县','连城县','漳平市','不详县','宁德市','蕉城区','霞浦县','古田县','屏南县','寿宁县','周宁县',
       '柘荣县','福安市','福鼎市','不详县','平潭综合实验区','平潭县','不详市','不详县','长乐区','建阳区','永定区']

year = ['2012', '2013', '2014', '2015', '2016', '2017', '2018', '2019', '2020']
m = []
for a in year:
    for i in idd:  #分市进行查询
        d = ['01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12']
        for j in d:
            one = a+j+'01'
            last = a+j+'31'
            sql ="select count(*) from 个案数据完整 where  nlive like '%"+i+"%'"+" and data between "+one+' and '+last
            #此时查出来的是某年某地方一个月的发病数
            cur.execute(sql)  #执行SQL语句
            data = cur.fetchone()  # 通过fetchone方法获取数据,但此时data的数据形式为元组，
            print(sql)
            print(f'{i}{a}年{j}月的发病数是：')
            print(data)
            m.append(data[0])

print(m)

new = [['01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12']]

# 该模块将列表中的值按照每12个截取切片列表，在将切片列表作为新列表的元素加入到新列表中
x = True
k = 0
while x:
    if k+12 <= len(m):
        new.append(m[k:k+12])
        k += 12
    else:
        x = False
print(new)

# 该模块实现将以上生成的列表按行写入excel表格并保存到指定路径
# 创建工作簿
f = xlwt.Workbook()
# 创建一个sheet
sheet1 = f.add_sheet('test', cell_overwrite_ok=True)

for i in range(len(new)):
    t = new[i]
    for j in range(len(t)):
        sheet1.write(i, j, t[j])

# 保存文件
f.save("C:\\Users\\xianyu\\Desktop\\福建2020.xlsx")